zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3u1xx/SI32_SIM3U1XX_CLKCTRL_A_Registers.h
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_MASK  0x00000002
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_SHIFT  1
// Disable the AHB clock to the DMA Controller (default).
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_DMACEN_DISABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_DMACEN_SHIFT)
// Enable the AHB clock to the DMA Controller.
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_DMACEN_ENABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_DMACEN_SHIFT)

#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_MASK  0x00000004
#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_SHIFT  2
// Disable the AHB clock to the Flash.
#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_DISABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_SHIFT)
// Enable the AHB clock to the Flash (default).
#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_ENABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_SHIFT)

#define SI32_CLKCTRL_A_AHBCLKG_EMIF0CEN_MASK  0x00000008
#define SI32_CLKCTRL_A_AHBCLKG_EMIF0CEN_SHIFT  3
// Disable the AHB clock to the External Memory Interface (EMIF) (default).
#define SI32_CLKCTRL_A_AHBCLKG_EMIF0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_AHBCLKG_EMIF0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_EMIF0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_EMIF0CEN_SHIFT)
// Enable the AHB clock to the External Memory Interface (EMIF).
#define SI32_CLKCTRL_A_AHBCLKG_EMIF0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_AHBCLKG_EMIF0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_EMIF0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_EMIF0CEN_SHIFT)

#define SI32_CLKCTRL_A_AHBCLKG_USB0BCEN_MASK  0x00000010
#define SI32_CLKCTRL_A_AHBCLKG_USB0BCEN_SHIFT  4
// Disable the AHB clock to the USB0 Buffer (default).
#define SI32_CLKCTRL_A_AHBCLKG_USB0BCEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_AHBCLKG_USB0BCEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_USB0BCEN_DISABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_USB0BCEN_SHIFT)
// Enable the AHB clock to the USB0 Buffer.
#define SI32_CLKCTRL_A_AHBCLKG_USB0BCEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_AHBCLKG_USB0BCEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_USB0BCEN_ENABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_USB0BCEN_SHIFT)



struct SI32_CLKCTRL_A_APBCLKG0_Struct
{
   union
   {
      struct
      {
         // PLL Module Clock Enable
         volatile uint32_t PLL0CEN: 1;
         // Port Bank Module Clock Enable
         volatile uint32_t PB0CEN: 1;
         // USART0 Module Clock Enable
         volatile uint32_t USART0CEN: 1;
         // USART1 Module Clock Enable
         volatile uint32_t USART1CEN: 1;
         // UART0 Module Clock Enable
         volatile uint32_t UART0CEN: 1;
         // UART1 Module Clock Enable
         volatile uint32_t UART1CEN: 1;
         // SPI0 Module Clock Enable
         volatile uint32_t SPI0CEN: 1;
         // SPI1 Module Clock Enable
         volatile uint32_t SPI1CEN: 1;
         // SPI2 Module Clock Enable
         volatile uint32_t SPI2CEN: 1;
         // I2C0 Module Clock Enable
         volatile uint32_t I2C0CEN: 1;
         // I2C1 Module Clock Enable
         volatile uint32_t I2C1CEN: 1;
         // EPCA0 Module Clock Enable
         volatile uint32_t EPCA0CEN: 1;
         // PCA0 Module Clock Enable
         volatile uint32_t PCA0CEN: 1;
         // PCA1 Module Clock Enable
         volatile uint32_t PCA1CEN: 1;
         // SSG0 Module Clock Enable
         volatile uint32_t SSG0CEN: 1;
         // TIMER0 Module Clock Enable
         volatile uint32_t TIMER0CEN: 1;
         // TIMER1 Module Clock Enable
         volatile uint32_t TIMER1CEN: 1;
         // SARADC0 Module Clock Enable
         volatile uint32_t ADC0CEN: 1;
         // SARADC1 Module Clock Enable
         volatile uint32_t ADC1CEN: 1;
         // Comparator 0 Module Clock Enable
         volatile uint32_t CMP0CEN: 1;
         // Comparator 1 Module Clock Enable
         volatile uint32_t CMP1CEN: 1;
         // Capacitive Sensing (CAPSENSE0) Module Clock Enable
         volatile uint32_t CS0CEN: 1;
         // AES0 Module Clock Enable
         volatile uint32_t AES0CEN: 1;
         // CRC0 Module Clock Enable
         volatile uint32_t CRC0CEN: 1;
         // IDAC0 Module Clock Enable
         volatile uint32_t IDAC0CEN: 1;
         // IDAC1 Module Clock Enable
         volatile uint32_t IDAC1CEN: 1;
         // Low Power Timer (LPTIMER0) Module Clock Enable
         volatile uint32_t LPT0CEN: 1;
         // I2S0 Module Clock Enable
         volatile uint32_t I2S0CEN: 1;
         // USB0 Module Clock Enable
         volatile uint32_t USB0CEN: 1;
         // External Regulator Clock Enable
         volatile uint32_t EVREGCEN: 1;
         // Flash Controller Clock Enable
         volatile uint32_t FLCTRLCEN: 1;
                  uint32_t reserved0: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_MASK  0x00000001
#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_SHIFT  0
// Disable the APB clock to the PLL0 registers (default).
#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_SHIFT)
// Enable the APB clock to the PLL0 registers.
#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_MASK  0x00000002
#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_SHIFT  1
// Disable the APB clock to the Port Bank Modules (default).
#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PB0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PB0CEN_SHIFT)
// Enable the APB clock to the Port Bank Modules.
#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PB0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PB0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_MASK  0x00000004
#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_SHIFT  2
// Disable the APB clock to the USART0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_USART0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_USART0CEN_SHIFT)
// Enable the APB clock to the USART0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_USART0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_USART0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_USART1CEN_MASK  0x00000008
#define SI32_CLKCTRL_A_APBCLKG0_USART1CEN_SHIFT  3
// Disable the APB clock to the USART1 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_USART1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_USART1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_USART1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_USART1CEN_SHIFT)
// Enable the APB clock to the USART1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_USART1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_USART1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_USART1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_USART1CEN_SHIFT)

