zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3u1xx/SI32_SIM3U1XX_CLKCTRL_A_Registers.h
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_MASK  0x00000010
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_SHIFT  4
// Disable the APB clock to the UART0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_UART0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_UART0CEN_SHIFT)
// Enable the APB clock to the UART0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_UART0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_UART0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_UART1CEN_MASK  0x00000020
#define SI32_CLKCTRL_A_APBCLKG0_UART1CEN_SHIFT  5
// Disable the APB clock to the UART1 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_UART1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_UART1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_UART1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_UART1CEN_SHIFT)
// Enable the APB clock to the UART1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_UART1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_UART1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_UART1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_UART1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_MASK  0x00000040
#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_SHIFT  6
// Disable the APB clock to the SPI0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_SHIFT)
// Enable the APB clock to the SPI0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_MASK  0x00000080
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_SHIFT  7
// Disable the APB clock to the SPI1 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_SHIFT)
// Enable the APB clock to the SPI1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_SPI2CEN_MASK  0x00000100
#define SI32_CLKCTRL_A_APBCLKG0_SPI2CEN_SHIFT  8
// Disable the APB clock to the SPI2 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_SPI2CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_SPI2CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SPI2CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SPI2CEN_SHIFT)
// Enable the APB clock to the SPI2 Module.
#define SI32_CLKCTRL_A_APBCLKG0_SPI2CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_SPI2CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SPI2CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SPI2CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_MASK  0x00000200
#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_SHIFT  9
// Disable the APB clock to the I2C0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_SHIFT)
// Enable the APB clock to the I2C0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_I2C1CEN_MASK  0x00000400
#define SI32_CLKCTRL_A_APBCLKG0_I2C1CEN_SHIFT  10
// Disable the APB clock to the I2C1 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_I2C1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_I2C1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_I2C1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_I2C1CEN_SHIFT)
// Enable the APB clock to the I2C1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_I2C1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_I2C1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_I2C1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_I2C1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_MASK  0x00000800
#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_SHIFT  11
// Disable the APB clock to the EPCA0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_SHIFT)
// Enable the APB clock to the EPCA0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_PCA0CEN_MASK  0x00001000
#define SI32_CLKCTRL_A_APBCLKG0_PCA0CEN_SHIFT  12
// Disable the APB clock to the PCA0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_PCA0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_PCA0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PCA0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PCA0CEN_SHIFT)
// Enable the APB clock to the PCA0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_PCA0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_PCA0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PCA0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PCA0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_PCA1CEN_MASK  0x00002000
#define SI32_CLKCTRL_A_APBCLKG0_PCA1CEN_SHIFT  13
// Disable the APB clock to the PCA1 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_PCA1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_PCA1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PCA1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PCA1CEN_SHIFT)
// Enable the APB clock to the PCA1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_PCA1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_PCA1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PCA1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PCA1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_SSG0CEN_MASK  0x00004000
#define SI32_CLKCTRL_A_APBCLKG0_SSG0CEN_SHIFT  14
// Disable the APB clock to the SSG0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_SSG0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_SSG0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SSG0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SSG0CEN_SHIFT)
// Enable the APB clock to the SSG0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_SSG0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_SSG0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SSG0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SSG0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_MASK  0x00008000
#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_SHIFT  15
// Disable the APB clock to the TIMER0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_SHIFT)
// Enable the APB clock to the TIMER0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_SHIFT)

