zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3u1xx/SI32_SIM3U1XX_CLKCTRL_A_Registers.h
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_MASK  0x00010000
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_SHIFT  16
// Disable the APB clock to the TIMER1 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_SHIFT)
// Enable the APB clock to the TIMER1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_MASK  0x00020000
#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_SHIFT  17
// Disable the APB clock to the SARADC0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_SHIFT)
// Enable the APB clock to the SARADC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_ADC1CEN_MASK  0x00040000
#define SI32_CLKCTRL_A_APBCLKG0_ADC1CEN_SHIFT  18
// Disable the APB clock to the SARADC1 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_ADC1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_ADC1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_ADC1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_ADC1CEN_SHIFT)
// Enable the APB clock to the SARADC1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_ADC1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_ADC1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_ADC1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_ADC1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_MASK  0x00080000
#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_SHIFT  19
// Disable the APB clock to the Comparator 0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_SHIFT)
// Enable the APB clock to the Comparator 0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_MASK  0x00100000
#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_SHIFT  20
// Disable the APB clock to the Comparator 1 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_SHIFT)
// Enable the APB clock to the Comparator 1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_CS0CEN_MASK  0x00200000
#define SI32_CLKCTRL_A_APBCLKG0_CS0CEN_SHIFT  21
// Disable the APB clock to the CAPSENSE0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_CS0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_CS0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CS0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CS0CEN_SHIFT)
// Enable the APB clock to the CAPSENSE0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_CS0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_CS0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CS0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CS0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_MASK  0x00400000
#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_SHIFT  22
// Disable the APB clock to the AES0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_AES0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_AES0CEN_SHIFT)
// Enable the APB clock to the AES0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_AES0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_AES0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_MASK  0x00800000
#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_SHIFT  23
// Disable the APB clock to the CRC0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_SHIFT)
// Enable the APB clock to the CRC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_MASK  0x01000000
#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_SHIFT  24
// Disable the APB clock to the IDAC0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_SHIFT)
// Enable the APB clock to the IDAC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_IDAC1CEN_MASK  0x02000000
#define SI32_CLKCTRL_A_APBCLKG0_IDAC1CEN_SHIFT  25
// Disable the APB clock to the IDAC1 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_IDAC1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_IDAC1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_IDAC1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_IDAC1CEN_SHIFT)
// Enable the APB clock to the IDAC1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_IDAC1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_IDAC1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_IDAC1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_IDAC1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_MASK  0x04000000
#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_SHIFT  26
// Disable the APB clock to the LPTIMER0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_SHIFT)
// Enable the APB clock to the LPTIMER0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_I2S0CEN_MASK  0x08000000
#define SI32_CLKCTRL_A_APBCLKG0_I2S0CEN_SHIFT  27
// Disable the APB clock to the I2S0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_I2S0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_I2S0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_I2S0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_I2S0CEN_SHIFT)
// Enable the APB clock to the I2S0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_I2S0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_I2S0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_I2S0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_I2S0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_USB0CEN_MASK  0x10000000
#define SI32_CLKCTRL_A_APBCLKG0_USB0CEN_SHIFT  28
// Disable the APB clock to the USB0 Module (default).
#define SI32_CLKCTRL_A_APBCLKG0_USB0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_USB0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_USB0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_USB0CEN_SHIFT)
// Enable the APB clock to the USB0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_USB0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_USB0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_USB0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_USB0CEN_SHIFT)

